Revit 2027 API
RebarContainerParameterManager.GetStringOverrideValue Method
 Get the string value for an overriden parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetStringOverrideValue(
	ElementId paramId
)
Public Function GetStringOverrideValue (
	paramId As ElementId
) As String
public:
String^ GetStringOverrideValue(
	ElementId^ paramId
)
member GetStringOverrideValue :
        paramId : ElementId -> string
Parameters
paramId ElementId
 The id of the parameter
Return Value
String
 The override value of the parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not the id of a parameter in the current document, or its value type is not sring. -or- paramId is not a Rebar Container parameter -or- paramId has no override
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace